geometry_optimisation/geometry_optimisation.org
#+title: =CP2K= Tutorial: Simple Geometry Optimisation Using =QUICKSTEP=
#+author: Lianheng Tong
#+date: Monday, 2014/01/27

* Introduction

  This tutorial is designed to illustrate how to relax the structure
  of a system (without changing the cell dimensions) using =CP2K=. We
  use the relaxation of a water (H\(_2\)O) molecule as an example.
  
  The example files are contained in =geo_opt.tgz= that comes with
  this tutorial. The calculation was carried out with =CP2K= version
  2.4.
  
  It should be noted that before running the geometry optimisation,
  the reader should have already know how to perform a simple
  Kohn-Sham Density Functional Theory energy and force calculation
  (this is covered in tutorial [[static_calculation][Calculating Energy and Forces using
  Quickstep]]), and they should also know how how to find a sufficient
  grid cutoff for the static energy calculations (this is covered in
  tutorial [[converging_cutoff][Converging the CUTOFF and REL_CUTOFF]]).

