geometry_optimisation/geometry_optimisation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title><code>CP2K</code> Tutorial: Simple Geometry Optimisation Using <code>QUICKSTEP</code></title>
<!-- 2014-01-27 Mon 22:34 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Lianheng Tong" />


<!-- The org-mode default configuration, with some of my modifications -->

<!-- switching on equation numbers support -->

<!-- Loading mathjax javascript using preamble and my math definitions -->
</head>
<body>
<div id="content">
<h1 class="title"><code>CP2K</code> Tutorial: Simple Geometry Optimisation Using <code>QUICKSTEP</code></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Input Files</a></li>
<li><a href="#sec-3">3. Results</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This tutorial is designed to illustrate how to relax the structure
of a system (without changing the cell dimensions) using <code>CP2K</code>. We
use the relaxation of a water (H\(_2\)O) molecule as an example.
</p>

<p>
The example files are contained in <code>geo_opt.tgz</code> that comes with
this tutorial. The calculation was carried out with <code>CP2K</code> version
2.4.
</p>

<p>
It should be noted that before running the geometry optimisation,
the reader should have already know how to perform a simple
Kohn-Sham Density Functional Theory energy and force calculation
(this is covered in tutorial <i>Calculating Energy and Forces using
Quickstep</i>), and they should also know how how to find a sufficient
grid cutoff for the static energy calculations (this is covered in
tutorial <i>Converging the CUTOFF and REL_CUTOFF</i>).
</p>
</div>
</div>
