geometry_optimisation/geometry_optimisation.org
* Input Files
  
  The input file for a geometry calculation is shown below:
  
  #+BEGIN_SRC cp2k
    &GLOBAL
      PROJECT H2O
      RUN_TYPE GEO_OPT
      PRINT_LEVEL LOW
    &END GLOBAL
    &FORCE_EVAL
      METHOD QS
      &SUBSYS
        &CELL
          ABC 12.4138 12.4138 12.4138
        &END CELL
        &COORD
          O      12.235322       1.376642      10.869880
          H      12.415139       2.233125      11.257611
          H      11.922476       1.573799       9.986994
        &END COORD
        &KIND H
          BASIS_SET DZVP-GTH-PADE
          POTENTIAL GTH-PADE-q1
        &END KIND
        &KIND O
          BASIS_SET DZVP-GTH-PADE
          POTENTIAL GTH-PADE-q6
        &END KIND
      &END SUBSYS
      &DFT
        BASIS_SET_FILE_NAME ./BASIS_SET
        POTENTIAL_FILE_NAME ./POTENTIAL
        &QS
          EPS_DEFAULT 1.0E-7
        &END QS
        &MGRID
          CUTOFF 200
          NGRIDS 4
          REL_CUTOFF 30
        &END MGRID
        &SCF
          SCF_GUESS ATOMIC
          EPS_SCF 1.0E-05
          MAX_SCF 200
          &DIAGONALIZATION T
            ALGORITHM STANDARD
          &END DIAGONALIZATION
          &MIXING T
            ALPHA 0.5
            METHOD PULAY_MIXING
            NPULAY 5
          &END MIXING
          &PRINT
            &RESTART OFF
            &END RESTART
          &END PRINT
        &END SCF
        &XC
          &XC_FUNCTIONAL PADE
          &END XC_FUNCTIONAL
        &END XC
      &END DFT
    &END FORCE_EVAL
    &MOTION
      &GEO_OPT
        TYPE MINIMIZATION
        MAX_DR    1.0E-03
        MAX_FORCE 1.0E-03
        RMS_DR    1.0E-03
        RMS_FORCE 1.0E-03
        MAX_ITER 200
        OPTIMIZER CG
        &CG
          MAX_STEEP_STEPS  0
          RESTART_LIMIT 9.0E-01
        &END CG
      &END GEO_OPT
      &CONSTRAINT
        &FIXED_ATOMS
          COMPONENTS_TO_FIX XYZ
          LIST 1
        &END FIXED_ATOMS
      &END CONSTRAINT
    &END MOTION
  #+END_SRC

  The reader should already be familiar with the [[http://manual.cp2k.org/trunk/CP2K_INPUT/GLOBAL.html][=GLOBAL=]] and
  [[http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL.html][=FORCE_EVAL=]] sections. For geometry optimisation calculations, we
  must set [[http://manual.cp2k.org/trunk/CP2K_INPUT/GLOBAL.html#desc_RUN_TYPE][=RUN_TYPE=]] in =GLOBAL= section to =GEO_OPT=:
  
  #+BEGIN_SRC cp2k
      RUN_TYPE GEO_OPT
  #+END_SRC
  
  In this example, we note that we have chosen diagonalisation of the
  Kohn-Sham Hamiltonian for the evaluation of wavefunctions, and used
  Pulay mixing for the self-consistency loops. 5 histories are used
  for Pulay mixing.

  The important section for geometry optimisation settings are
  contained in subsection [[http://manual.cp2k.org/trunk/CP2K_INPUT/MOTION/GEO_OPT.html][=GEO_OPT=]] of [[http://manual.cp2k.org/trunk/CP2K_INPUT/MOTION.html][=MOTION=]] section. Note that
  =GEO_OPT= subsection only applies to the calculation where the cell
  dimensions do not change. Calculations which allows the relaxation
  of the cell are covered in a separate tutorial.

  #+BEGIN_SRC cp2k
      &GEO_OPT
        TYPE MINIMIZATION
        MAX_DR    1.0E-03
        MAX_FORCE 1.0E-03
        RMS_DR    1.0E-03
        RMS_FORCE 1.0E-03
        MAX_ITER 200
        OPTIMIZER CG
        &CG
          MAX_STEEP_STEPS  0
          RESTART_LIMIT 9.0E-01
        &END CG
      &END GEO_OPT
  #+END_SRC

  The [[http://manual.cp2k.org/trunk/CP2K_INPUT/MOTION/GEO_OPT.html#desc_TYPE][=TYPE=]] keyword sets whether the geometry optimisation is for
  finding the local minima (=MINIMIZATION=) or for finding the saddle
  point transition state (=TRANSITION_STATE=). The keywords [[http://manual.cp2k.org/trunk/CP2K_INPUT/MOTION/GEO_OPT.html#desc_MAX_DR][=MAX_DR=]],
  [[http://manual.cp2k.org/trunk/CP2K_INPUT/MOTION/GEO_OPT.html#desc_MAX_FORCE][=MAX_FORCE=]], [[http://manual.cp2k.org/trunk/CP2K_INPUT/MOTION/GEO_OPT.html#desc_RMS_DR][=RMS_DR=]] and [[http://manual.cp2k.org/trunk/CP2K_INPUT/MOTION/GEO_OPT.html#desc_RMS_FORCE][=RMS_FORCE=]] set the criteria of whether an
  optimised geometry is reached. =MAX_DR= and =RMS_DR= (in Bohr) are
  the tolerance on the maximum and root-mean-square of atomic
  displacements from the previous geometry optimisation iteration;
  =MAX_FORCE= and =RMS_FORCE= (in Bohr/Hartree) are the tolerance on
  the maximum and root-mean-square of atomic forces. The geometry is
  considered to be optimised /only when all four criteria are
  satisfied/. The keyword [[http://manual.cp2k.org/trunk/CP2K_INPUT/MOTION/GEO_OPT.html#desc_MAX_ITER][=MAX_ITER=]] sets the maximum number of
  geometry optimisation iterations. [[http://manual.cp2k.org/trunk/CP2K_INPUT/MOTION/GEO_OPT.html#desc_OPTIMIZER][=OPTIMIZER=]] sets the algorithm for
  finding the stationary points; in this example we have chosen the
  conjugate gradients (=CG=) method.

  The [[http://manual.cp2k.org/trunk/CP2K_INPUT/MOTION/GEO_OPT/CG.html][=CG=]] subsection sets options for the conjugate gradients
  algorithm. In this case, we have configured it so that no steepest
  descent steps are to be performed before the start of the conjugate
  gradients algorithm; and the CG algorithm should be reset (and one
  steepest descent step is performed) if the cosine of the angles
  between two consecutive searching directions is less than 0.9.

  #+BEGIN_SRC cp2k
      &CONSTRAINT
        &FIXED_ATOMS
          COMPONENTS_TO_FIX XYZ
          LIST 1
        &END FIXED_ATOMS
      &END CONSTRAINT
  #+END_SRC

  We can add constraints to atomic movements by using the [[http://manual.cp2k.org/trunk/CP2K_INPUT/MOTION/CONSTRAINT.html][=CONSTRAINT=]]
  subsection in =MOTION= section. In this example, we choose to fix
  particular atoms using the [[http://manual.cp2k.org/trunk/CP2K_INPUT/MOTION/CONSTRAINT/FIXED_ATOMS.html][=FIXED_ATOMS=]] subsection. The keyword
  [[http://manual.cp2k.org/trunk/CP2K_INPUT/MOTION/CONSTRAINT/FIXED_ATOMS.html#desc_COMPONENTS_TO_FIX][=COMPONENTS_TO_FIX=]] sets which of the =X= =Y= =Z= directions are to
  be fixed, and in this case, the atoms will be completely pinned in
  all directions (=XYZ=). The list of atoms to be constrained are
  given by the [[http://manual.cp2k.org/trunk/CP2K_INPUT/MOTION/CONSTRAINT/FIXED_ATOMS.html#desc_LIST][=LIST=]] keyword:

  #+BEGIN_SRC cp2k
    LIST 1 2 3 ... N  
  #+END_SRC

  The numbers to the right of =LIST= are the list of atomic indices,
  and correspond to the order (from top to bottom) of the atoms given
  in the [[http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/SUBSYS/COORD.html][=COORD=]] subsection of [[http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/SUBSYS.html][=SUBSYS=]] (of [[http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL.html][=FORCE_EVAL=]]). In our
  example, we have fixed the oxygen atom during geometry optimisation,
  so that the water molecule will not move around while its structure
  is being relaxed.

