geometry_optimisation/geometry_optimisation.html
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Input Files</h2>
<div class="outline-text-2" id="text-2">
<p>
The input file for a geometry calculation is shown below:
</p>

<div class="org-src-container">

<pre class="src src-cp2k"><span style="color: #268bd2;">&amp;GLOBAL</span>
  <span style="color: #859900; font-weight: bold;">PROJECT</span> H2O
  <span style="color: #859900; font-weight: bold;">RUN_TYPE</span> GEO_OPT
  <span style="color: #859900; font-weight: bold;">PRINT_LEVEL</span> LOW
<span style="color: #268bd2;">&amp;END GLOBAL</span>
<span style="color: #268bd2;">&amp;FORCE_EVAL</span>
  <span style="color: #859900; font-weight: bold;">METHOD</span> QS
  <span style="color: #268bd2;">&amp;SUBSYS</span>
    <span style="color: #268bd2;">&amp;CELL</span>
      <span style="color: #859900; font-weight: bold;">ABC</span> 12.4138 12.4138 12.4138
    <span style="color: #268bd2;">&amp;END CELL</span>
    <span style="color: #268bd2;">&amp;COORD</span>
      <span style="color: #859900; font-weight: bold;">O</span>      12.235322       1.376642      10.869880
      <span style="color: #859900; font-weight: bold;">H</span>      12.415139       2.233125      11.257611
      <span style="color: #859900; font-weight: bold;">H</span>      11.922476       1.573799       9.986994
    <span style="color: #268bd2;">&amp;END COORD</span>
    <span style="color: #268bd2;">&amp;KIND</span> H
      <span style="color: #859900; font-weight: bold;">BASIS_SET</span> DZVP-GTH-PADE
      <span style="color: #859900; font-weight: bold;">POTENTIAL</span> GTH-PADE-q1
    <span style="color: #268bd2;">&amp;END KIND</span>
    <span style="color: #268bd2;">&amp;KIND</span> O
      <span style="color: #859900; font-weight: bold;">BASIS_SET</span> DZVP-GTH-PADE
      <span style="color: #859900; font-weight: bold;">POTENTIAL</span> GTH-PADE-q6
    <span style="color: #268bd2;">&amp;END KIND</span>
  <span style="color: #268bd2;">&amp;END SUBSYS</span>
  <span style="color: #268bd2;">&amp;DFT</span>
    <span style="color: #859900; font-weight: bold;">BASIS_SET_FILE_NAME</span> ./BASIS_SET
    <span style="color: #859900; font-weight: bold;">POTENTIAL_FILE_NAME</span> ./POTENTIAL
    <span style="color: #268bd2;">&amp;QS</span>
      <span style="color: #859900; font-weight: bold;">EPS_DEFAULT</span> 1.0E-7
    <span style="color: #268bd2;">&amp;END QS</span>
    <span style="color: #268bd2;">&amp;MGRID</span>
      <span style="color: #859900; font-weight: bold;">CUTOFF</span> 200
      <span style="color: #859900; font-weight: bold;">NGRIDS</span> 4
      <span style="color: #859900; font-weight: bold;">REL_CUTOFF</span> 30
    <span style="color: #268bd2;">&amp;END MGRID</span>
    <span style="color: #268bd2;">&amp;SCF</span>
      <span style="color: #859900; font-weight: bold;">SCF_GUESS</span> ATOMIC
      <span style="color: #859900; font-weight: bold;">EPS_SCF</span> 1.0E-05
      <span style="color: #859900; font-weight: bold;">MAX_SCF</span> 200
      <span style="color: #268bd2;">&amp;DIAGONALIZATION</span> T
        <span style="color: #859900; font-weight: bold;">ALGORITHM</span> STANDARD
      <span style="color: #268bd2;">&amp;END DIAGONALIZATION</span>
      <span style="color: #268bd2;">&amp;MIXING</span> T
        <span style="color: #859900; font-weight: bold;">ALPHA</span> 0.5
        <span style="color: #859900; font-weight: bold;">METHOD</span> PULAY_MIXING
        <span style="color: #859900; font-weight: bold;">NPULAY</span> 5
      <span style="color: #268bd2;">&amp;END MIXING</span>
      <span style="color: #268bd2;">&amp;PRINT</span>
        <span style="color: #268bd2;">&amp;RESTART</span> OFF
        <span style="color: #268bd2;">&amp;END RESTART</span>
      <span style="color: #268bd2;">&amp;END PRINT</span>
    <span style="color: #268bd2;">&amp;END SCF</span>
    <span style="color: #268bd2;">&amp;XC</span>
      <span style="color: #268bd2;">&amp;XC_FUNCTIONAL</span> PADE
      <span style="color: #268bd2;">&amp;END XC_FUNCTIONAL</span>
    <span style="color: #268bd2;">&amp;END XC</span>
  <span style="color: #268bd2;">&amp;END DFT</span>
<span style="color: #268bd2;">&amp;END FORCE_EVAL</span>
<span style="color: #268bd2;">&amp;MOTION</span>
  <span style="color: #268bd2;">&amp;GEO_OPT</span>
    <span style="color: #859900; font-weight: bold;">TYPE</span> MINIMIZATION
    <span style="color: #859900; font-weight: bold;">MAX_DR</span>    1.0E-03
    <span style="color: #859900; font-weight: bold;">MAX_FORCE</span> 1.0E-03
    <span style="color: #859900; font-weight: bold;">RMS_DR</span>    1.0E-03
    <span style="color: #859900; font-weight: bold;">RMS_FORCE</span> 1.0E-03
    <span style="color: #859900; font-weight: bold;">MAX_ITER</span> 200
    <span style="color: #859900; font-weight: bold;">OPTIMIZER</span> CG
    <span style="color: #268bd2;">&amp;CG</span>
      <span style="color: #859900; font-weight: bold;">MAX_STEEP_STEPS</span>  0
      <span style="color: #859900; font-weight: bold;">RESTART_LIMIT</span> 9.0E-01
    <span style="color: #268bd2;">&amp;END CG</span>
  <span style="color: #268bd2;">&amp;END GEO_OPT</span>
  <span style="color: #268bd2;">&amp;CONSTRAINT</span>
    <span style="color: #268bd2;">&amp;FIXED_ATOMS</span>
      <span style="color: #859900; font-weight: bold;">COMPONENTS_TO_FIX</span> XYZ
      <span style="color: #859900; font-weight: bold;">LIST</span> 1
    <span style="color: #268bd2;">&amp;END FIXED_ATOMS</span>
  <span style="color: #268bd2;">&amp;END CONSTRAINT</span>
<span style="color: #268bd2;">&amp;END MOTION</span>
</pre>
</div>

<p>
The reader should already be familiar with the <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/GLOBAL.html"><code>GLOBAL</code></a> and
<a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL.html"><code>FORCE_EVAL</code></a> sections. For geometry optimisation calculations, we
must set <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/GLOBAL.html#desc_RUN_TYPE"><code>RUN_TYPE</code></a> in <code>GLOBAL</code> section to <code>GEO_OPT</code>:
</p>

<div class="org-src-container">

<pre class="src src-cp2k"><span style="color: #859900; font-weight: bold;">RUN_TYPE</span> GEO_OPT
</pre>
</div>

<p>
In this example, we note that we have chosen diagonalisation of the
Kohn-Sham Hamiltonian for the evaluation of wavefunctions, and used
Pulay mixing for the self-consistency loops. 5 histories are used
for Pulay mixing.
</p>

<p>
The important section for geometry optimisation settings are
contained in subsection <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/MOTION/GEO_OPT.html"><code>GEO_OPT</code></a> of <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/MOTION.html"><code>MOTION</code></a> section. Note that
<code>GEO_OPT</code> subsection only applies to the calculation where the cell
dimensions do not change. Calculations which allows the relaxation
of the cell are covered in a separate tutorial.
</p>

<div class="org-src-container">

<pre class="src src-cp2k"><span style="color: #268bd2;">&amp;GEO_OPT</span>
  <span style="color: #859900; font-weight: bold;">TYPE</span> MINIMIZATION
  <span style="color: #859900; font-weight: bold;">MAX_DR</span>    1.0E-03
  <span style="color: #859900; font-weight: bold;">MAX_FORCE</span> 1.0E-03
  <span style="color: #859900; font-weight: bold;">RMS_DR</span>    1.0E-03
  <span style="color: #859900; font-weight: bold;">RMS_FORCE</span> 1.0E-03
  <span style="color: #859900; font-weight: bold;">MAX_ITER</span> 200
  <span style="color: #859900; font-weight: bold;">OPTIMIZER</span> CG
  <span style="color: #268bd2;">&amp;CG</span>
    <span style="color: #859900; font-weight: bold;">MAX_STEEP_STEPS</span>  0
    <span style="color: #859900; font-weight: bold;">RESTART_LIMIT</span> 9.0E-01
  <span style="color: #268bd2;">&amp;END CG</span>
<span style="color: #268bd2;">&amp;END GEO_OPT</span>
</pre>
</div>

<p>
The <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/MOTION/GEO_OPT.html#desc_TYPE"><code>TYPE</code></a> keyword sets whether the geometry optimisation is for
finding the local minima (<code>MINIMIZATION</code>) or for finding the saddle
point transition state (<code>TRANSITION_STATE</code>). The keywords <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/MOTION/GEO_OPT.html#desc_MAX_DR"><code>MAX_DR</code></a>,
<a href="http://manual.cp2k.org/trunk/CP2K_INPUT/MOTION/GEO_OPT.html#desc_MAX_FORCE"><code>MAX_FORCE</code></a>, <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/MOTION/GEO_OPT.html#desc_RMS_DR"><code>RMS_DR</code></a> and <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/MOTION/GEO_OPT.html#desc_RMS_FORCE"><code>RMS_FORCE</code></a> set the criteria of whether an
optimised geometry is reached. <code>MAX_DR</code> and <code>RMS_DR</code> (in Bohr) are
the tolerance on the maximum and root-mean-square of atomic
displacements from the previous geometry optimisation iteration;
<code>MAX_FORCE</code> and <code>RMS_FORCE</code> (in Bohr/Hartree) are the tolerance on
the maximum and root-mean-square of atomic forces. The geometry is
considered to be optimised <i>only when all four criteria are
satisfied</i>. The keyword <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/MOTION/GEO_OPT.html#desc_MAX_ITER"><code>MAX_ITER</code></a> sets the maximum number of
geometry optimisation iterations. <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/MOTION/GEO_OPT.html#desc_OPTIMIZER"><code>OPTIMIZER</code></a> sets the algorithm for
finding the stationary points; in this example we have chosen the
conjugate gradients (<code>CG</code>) method.
</p>

<p>
The <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/MOTION/GEO_OPT/CG.html"><code>CG</code></a> subsection sets options for the conjugate gradients
algorithm. In this case, we have configured it so that no steepest
descent steps are to be performed before the start of the conjugate
gradients algorithm; and the CG algorithm should be reset (and one
steepest descent step is performed) if the cosine of the angles
between two consecutive searching directions is less than 0.9.
</p>

<div class="org-src-container">

<pre class="src src-cp2k"><span style="color: #268bd2;">&amp;CONSTRAINT</span>
  <span style="color: #268bd2;">&amp;FIXED_ATOMS</span>
    <span style="color: #859900; font-weight: bold;">COMPONENTS_TO_FIX</span> XYZ
    <span style="color: #859900; font-weight: bold;">LIST</span> 1
  <span style="color: #268bd2;">&amp;END FIXED_ATOMS</span>
<span style="color: #268bd2;">&amp;END CONSTRAINT</span>
</pre>
</div>

<p>
We can add constraints to atomic movements by using the <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/MOTION/CONSTRAINT.html"><code>CONSTRAINT</code></a>
subsection in <code>MOTION</code> section. In this example, we choose to fix
particular atoms using the <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/MOTION/CONSTRAINT/FIXED_ATOMS.html"><code>FIXED_ATOMS</code></a> subsection. The keyword
<a href="http://manual.cp2k.org/trunk/CP2K_INPUT/MOTION/CONSTRAINT/FIXED_ATOMS.html#desc_COMPONENTS_TO_FIX"><code>COMPONENTS_TO_FIX</code></a> sets which of the <code>X</code> <code>Y</code> <code>Z</code> directions are to
be fixed, and in this case, the atoms will be completely pinned in
all directions (<code>XYZ</code>). The list of atoms to be constrained are
given by the <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/MOTION/CONSTRAINT/FIXED_ATOMS.html#desc_LIST"><code>LIST</code></a> keyword:
</p>

<div class="org-src-container">

<pre class="src src-cp2k"><span style="color: #859900; font-weight: bold;">LIST</span> 1 2 3 ... N
</pre>
</div>

<p>
The numbers to the right of <code>LIST</code> are the list of atomic indices,
and correspond to the order (from top to bottom) of the atoms given
in the <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/SUBSYS/COORD.html"><code>COORD</code></a> subsection of <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL/SUBSYS.html"><code>SUBSYS</code></a> (of <a href="http://manual.cp2k.org/trunk/CP2K_INPUT/FORCE_EVAL.html"><code>FORCE_EVAL</code></a>). In our
example, we have fixed the oxygen atom during geometry optimisation,
so that the water molecule will not move around while its structure
is being relaxed.
</p>
</div>
</div>
