geometry_optimisation/geometry_optimisation.org
* Results

  The example is run using the serial version of the =CP2K= binaries:

  #+BEGIN_EXAMPLE
    cp2k.sopt -o H2O.out H2O.inp &
  #+END_EXAMPLE

  After the job has finished, you should obtain the following files:

  - =H2O.out=
  - =H2O-pos-1.xyz=
  - =H2O-1.restart=
  - =H2O-1.restart.bak-1=
  - =H2O-1.restart.bak-2=
  - =H2O-1.restart.bak-3=

  Again, the file =H2O.out= contains the main output of the
  job. =H2O-pos-1.xyz= contains the trace of atomic coordinates at
  each geometry optimisation step in the =xyz= file format. The last
  set of atomic coordinates corresponds to the relaxed
  structure. =H2O-1.restart= is a =CP2K= input file, similar to
  =H2O.inp=, which contains the latest atomic coordinates of the water
  molecule. Should the job die for some reason, you can continue the
  job using the latest atomic coordinates by using command:

  #+BEGIN_EXAMPLE
    cp2k.sopt -o H2O.out H2O-1.restart &
  #+END_EXAMPLE
  
  You can of course also use =H2O-1.restart= as a template for writing
  an input for further calculations using the relaxed atomic
  structures.

  The files =H2O-1.restart.back-*= are backup restart files with
  atomic coordinates obtained from the previous 1, 2 and 3 geometric
  optimisation iterations. =H2O-1.restart.bak-1= should be the same as
  =H2O-1.restart=.

  In the main output file =H2O.out=, at the end of each geometry
  optimisation step, we will have the following information:

  #+BEGIN_EXAMPLE
     --------  Informations at step =     1 ------------
      Optimization Method        =                   SD
      Total Energy               =       -17.1643447508
      Real energy change         =        -0.0006776683
      Decrease in energy         =                  YES
      Used time                  =               90.837
    
      Convergence check :
      Max. step size             =         0.0336570168
      Conv. limit for step size  =         0.0010000000
      Convergence in step size   =                   NO
      RMS step size              =         0.0168136889
      Conv. limit for RMS step   =         0.0010000000
      Convergence in RMS step    =                   NO
      Max. gradient              =         0.0182785685
      Conv. limit for gradients  =         0.0010000000
      Conv. for gradients        =                   NO
      RMS gradient               =         0.0091312361
      Conv. limit for RMS grad.  =         0.0010000000
      Conv. for gradients        =                   NO
     ---------------------------------------------------
  #+END_EXAMPLE

  The above output segment states that at the end of geometry
  optimisation step 1, the total energy of the system is
  -17.1643447508 (Ha) and none of the criteria for optimised geometry
  has been reached. The iteration therefore will carry on, until all
  criteria becomes "=YES=".

  At the end of geometry optimisation, one should obtain something
  like:

  #+BEGIN_EXAMPLE
     --------  Informations at step =    11 ------------
      Optimization Method        =                   SD
      Total Energy               =       -17.1646204766
      Real energy change         =        -0.0000000529
      Decrease in energy         =                  YES
      Used time                  =               49.893
    
      Convergence check :
      Max. step size             =         0.0003393150
      Conv. limit for step size  =         0.0010000000
      Convergence in step size   =                  YES
      RMS step size              =         0.0001493298
      Conv. limit for RMS step   =         0.0010000000
      Convergence in RMS step    =                  YES
      Max. gradient              =         0.0001787448
      Conv. limit for gradients  =         0.0010000000
      Conv. in gradients         =                  YES
      RMS gradient               =         0.0000786642
      Conv. limit for RMS grad.  =         0.0010000000
      Conv. in RMS gradients     =                  YES
     ---------------------------------------------------
  #+END_EXAMPLE

  which clearly shows all criteria have been satisfied.

  The final Kohn-Sham energies can be obtained at the end of the
  output:

  #+BEGIN_EXAMPLE
     ,*******************************************************************************
     ,***                    GEOMETRY OPTIMIZATION COMPLETED                      ***
     ,*******************************************************************************
    
                        Reevaluating energy at the minimum
    
     Number of electrons:                                                          8
     Number of occupied orbitals:                                                  4
     Number of molecular orbitals:                                                 4
    
     Number of orbital functions:                                                 23
     Number of independent orbital functions:                                     23
    
      Parameters for the always stable predictor-corrector (ASPC) method:
    
      ASPC order: 3
    
      B(1) =   3.000000
      B(2) =  -3.428571
      B(3) =   1.928571
      B(4) =  -0.571429
      B(5) =   0.071429
    
     Extrapolation method: ASPC
    
    
     SCF WAVEFUNCTION OPTIMIZATION
    
      Step     Update method      Time    Convergence         Total energy    Change
      ------------------------------------------------------------------------------
         1 Pulay/Diag. 0.50E+00    0.5     0.00005615       -17.1646204762 -1.72E+01
         2 Pulay/Diag. 0.50E+00    1.0     0.00000563       -17.1646347711 -1.43E-05
    
      ,*** SCF run converged in     2 steps ***
    
    
      Electronic density on regular grids:         -8.0000016293       -0.0000016293
      Core density on regular grids:                7.9999992554       -0.0000007446
      Total charge density on r-space grids:       -0.0000023739
      Total charge density g-space grids:          -0.0000023739
    
      Overlap energy of the core charge distribution:               0.00000004555422
      Self energy of the core charge distribution:                -43.83289054591484
      Core Hamiltonian energy:                                     12.82175605770555
      Hartree energy:                                              17.97395116120845
      Exchange-correlation energy:                                 -4.12745148966141
    
      Total energy:                                               -17.16463477110803
    
     ENERGY| Total FORCE_EVAL ( QS ) energy (a.u.):              -17.164634771108034
  #+END_EXAMPLE
