geometry_optimisation/geometry_optimisation.html
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Results</h2>
<div class="outline-text-2" id="text-3">
<p>
The example is run using the serial version of the <code>CP2K</code> binaries:
</p>

<pre class="example">
cp2k.sopt -o H2O.out H2O.inp &amp;
</pre>

<p>
After the job has finished, you should obtain the following files:
</p>

<ul class="org-ul">
<li><code>H2O.out</code>
</li>
<li><code>H2O-pos-1.xyz</code>
</li>
<li><code>H2O-1.restart</code>
</li>
<li><code>H2O-1.restart.bak-1</code>
</li>
<li><code>H2O-1.restart.bak-2</code>
</li>
<li><code>H2O-1.restart.bak-3</code>
</li>
</ul>

<p>
Again, the file <code>H2O.out</code> contains the main output of the
job. <code>H2O-pos-1.xyz</code> contains the trace of atomic coordinates at
each geometry optimisation step in the <code>xyz</code> file format. The last
set of atomic coordinates corresponds to the relaxed
structure. <code>H2O-1.restart</code> is a <code>CP2K</code> input file, similar to
<code>H2O.inp</code>, which contains the latest atomic coordinates of the water
molecule. Should the job die for some reason, you can continue the
job using the latest atomic coordinates by using command:
</p>

<pre class="example">
cp2k.sopt -o H2O.out H2O-1.restart &amp;
</pre>

<p>
You can of course also use <code>H2O-1.restart</code> as a template for writing
an input for further calculations using the relaxed atomic
structures.
</p>

<p>
The files <code>H2O-1.restart.back-*</code> are backup restart files with
atomic coordinates obtained from the previous 1, 2 and 3 geometric
optimisation iterations. <code>H2O-1.restart.bak-1</code> should be the same as
<code>H2O-1.restart</code>.
</p>

<p>
In the main output file <code>H2O.out</code>, at the end of each geometry
optimisation step, we will have the following information:
</p>

<pre class="example">
--------  Informations at step =     1 ------------
 Optimization Method        =                   SD
 Total Energy               =       -17.1643447508
 Real energy change         =        -0.0006776683
 Decrease in energy         =                  YES
 Used time                  =               90.837

 Convergence check :
 Max. step size             =         0.0336570168
 Conv. limit for step size  =         0.0010000000
 Convergence in step size   =                   NO
 RMS step size              =         0.0168136889
 Conv. limit for RMS step   =         0.0010000000
 Convergence in RMS step    =                   NO
 Max. gradient              =         0.0182785685
 Conv. limit for gradients  =         0.0010000000
 Conv. for gradients        =                   NO
 RMS gradient               =         0.0091312361
 Conv. limit for RMS grad.  =         0.0010000000
 Conv. for gradients        =                   NO
---------------------------------------------------
</pre>

<p>
The above output segment states that at the end of geometry
optimisation step 1, the total energy of the system is
-17.1643447508 (Ha) and none of the criteria for optimised geometry
has been reached. The iteration therefore will carry on, until all
criteria becomes "<code>YES</code>".
</p>

<p>
At the end of geometry optimisation, one should obtain something
like:
</p>

<pre class="example">
--------  Informations at step =    11 ------------
 Optimization Method        =                   SD
 Total Energy               =       -17.1646204766
 Real energy change         =        -0.0000000529
 Decrease in energy         =                  YES
 Used time                  =               49.893

 Convergence check :
 Max. step size             =         0.0003393150
 Conv. limit for step size  =         0.0010000000
 Convergence in step size   =                  YES
 RMS step size              =         0.0001493298
 Conv. limit for RMS step   =         0.0010000000
 Convergence in RMS step    =                  YES
 Max. gradient              =         0.0001787448
 Conv. limit for gradients  =         0.0010000000
 Conv. in gradients         =                  YES
 RMS gradient               =         0.0000786642
 Conv. limit for RMS grad.  =         0.0010000000
 Conv. in RMS gradients     =                  YES
---------------------------------------------------
</pre>

<p>
which clearly shows all criteria have been satisfied.
</p>

<p>
The final Kohn-Sham energies can be obtained at the end of the
output:
</p>

<pre class="example">
*******************************************************************************
***                    GEOMETRY OPTIMIZATION COMPLETED                      ***
*******************************************************************************

                   Reevaluating energy at the minimum

Number of electrons:                                                          8
Number of occupied orbitals:                                                  4
Number of molecular orbitals:                                                 4

Number of orbital functions:                                                 23
Number of independent orbital functions:                                     23

 Parameters for the always stable predictor-corrector (ASPC) method:

 ASPC order: 3

 B(1) =   3.000000
 B(2) =  -3.428571
 B(3) =   1.928571
 B(4) =  -0.571429
 B(5) =   0.071429

Extrapolation method: ASPC


SCF WAVEFUNCTION OPTIMIZATION

 Step     Update method      Time    Convergence         Total energy    Change
 ------------------------------------------------------------------------------
    1 Pulay/Diag. 0.50E+00    0.5     0.00005615       -17.1646204762 -1.72E+01
    2 Pulay/Diag. 0.50E+00    1.0     0.00000563       -17.1646347711 -1.43E-05

 *** SCF run converged in     2 steps ***


 Electronic density on regular grids:         -8.0000016293       -0.0000016293
 Core density on regular grids:                7.9999992554       -0.0000007446
 Total charge density on r-space grids:       -0.0000023739
 Total charge density g-space grids:          -0.0000023739

 Overlap energy of the core charge distribution:               0.00000004555422
 Self energy of the core charge distribution:                -43.83289054591484
 Core Hamiltonian energy:                                     12.82175605770555
 Hartree energy:                                              17.97395116120845
 Exchange-correlation energy:                                 -4.12745148966141

 Total energy:                                               -17.16463477110803

ENERGY| Total FORCE_EVAL ( QS ) energy (a.u.):              -17.164634771108034
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Monday, 2014/01/27</p>
<p class="author">Author: Lianheng Tong</p>
<p class="date">Created: 2014-01-27 Mon 22:34</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5g)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
